#include "sys.h"  
//////////////////////////////////////////////////////////////////////////////////	 
 
//系统时钟初始化	
//STM32F4工程-库函数版本
//********************************************************************************
//修改说明
//无
//////////////////////////////////////////////////////////////////////////////////  


//THUMB指令不支持汇编内联
//采用如下方法实现执行汇编指令WFI  
#define WFI_SET()       __asm("wfi")
#define INTX_DISABLE()  __disable_irq()
#define INTX_ENABLE()   __enable_irq()

//设置栈顶地址
//addr:栈顶地址
void MSR_MSP(u32 addr) 
{
	//MSR MSP, r0 			//set Main Stack value
	//BX r14
}
















